[
    {
        "id": 1,
        "title": "Generator Page",
        "images": {
            "desktop": "images/generator-page.png",
            "phone": "",
            "tablet": ""
        },
        "link": "Projects/generator-page/index.html",
        "description": {
            "short": "A dynamic generator with custom inputs, designed for beginners learning the DOM API.",
            "long": "The Generator Page is a hands-on project aimed at novice developers looking to enhance their JavaScript skills through practical application of DOM manipulation. Featuring custom inputs, this project combines functionality with a touch of humor, making it an engaging learning experience."
        }
    },
    {
        "id": 2,
        "title": "Single Price Grid Component",
        "images": {
            "desktop": "images/single-price-grid-component.png",
            "phone": "",
            "tablet": ""
        },
        "link": "Projects/single-price-grid-component-master/index.html",
        "description": {
            "short": "A responsive single price grid component for desktop.",
            "long": "The Single Price Grid Component project showcases my proficiency in creating responsive designs for desktop environments. With a focus on clarity and visual appeal, this component provides a straightforward pricing display suitable for various applications."
        }
    },
    {
        "id": 3,
        "title": "QR Code Component",
        "images": {
            "desktop": "images/qr-code-component.png",
            "phone": "",
            "tablet": ""
        },
        "link": "Projects/qr-code-component-main/index.html",
        "description": {
            "short": "A simple QR code component.",
            "long": "The QR Code Component project serves as a quick warm-up exercise, emphasizing simplicity and functionality. Designed to generate QR codes effortlessly, it lays the groundwork for more complex coding challenges and project undertakings."
        }
    },
    {
        "id": 4,
        "title": "Blog Preview Card",
        "images": {
            "desktop": "images/blog-preview-card.png",
            "phone": "",
            "tablet": ""
        },
        "link": "Projects/blog-preview-card-main/index.html",
        "description": {
            "short": "A preview card for blog posts.",
            "long": "The Blog Preview Card project demonstrates my ability to create visually appealing blog post previews. With a clean layout and concise information presentation, this project enhances user engagement by offering a glimpse into featured content before exploration."
        }
    },
    {
        "id": 5,
        "title": "Testimonials Grid Section",
        "images": {
            "desktop": "images/testimonials-grid-section.png",
            "phone": "",
            "tablet": ""
        },
        "link": "Projects/testimonials-grid-section-main/index.html",
        "description": {
            "short": "A grid layout for testimonials.",
            "long": "The Testimonials Grid Section project exemplifies my mastery of CSS Flexbox and Grid technologies. Designed to showcase customer feedback effectively, it utilizes flexible layouts to accommodate diverse content lengths while maintaining a cohesive visual structure."
        }
    },
    {
        "id": 6,
        "title": "Product Preview Card",
        "images": {
            "desktop": "images/product-preview-card.png",
            "phone": "",
            "tablet": ""
        },
        "link": "Projects/product-preview-card-component-main/index.html",
        "description": {
            "short": "A preview card for products.",
            "long": "The Product Preview Card project serves as an introductory exercise in creating interactive product displays. Featuring a compact design and intuitive navigation, it prepares me for more advanced frontend development challenges through practical application and exploration."
        }
    }
]
